import json
import csv

data = [

  {
    "id": 254,
    "q": "നിങ്ങൾക്ക് ഒരേ സമയം എത്ര ലൈസൻസുകൾ കൈവശം വെക്കാം?",
    "options": [
      "പരമാവധി മൂന്ന് ലൈസൻസുകൾ",
      "ഒന്നിലധികം തരം വാഹനങ്ങൾ ഓടിക്കാൻ ഉപയോഗിക്കാവുന്ന ഒരൊറ്റ ലൈസൻസ്",
      "നിങ്ങൾക്ക് എത്ര ലൈസൻസുകൾ വേണമെങ്കിലും ഉണ്ടാകാം, എന്നിരുന്നാലും, ഓരോ ലൈസൻസും ഒരു ക്ലാസ് വാഹനത്തിന് മാത്രമേ അനുവദിക്കൂ",
      "മുകളിൽ പറഞ്ഞവ ഒന്നുമല്ല"
    ],
    "sign": "/signs/sign_254.png",
    "answerIndex": 1
  },
  {
    "id": 255,
    "q": "സാധുവായ ലൈസൻസ് ഇല്ലാത്ത ഒരാൾക്ക് മോട്ടോർ വാഹനം ഓടിക്കാൻ നൽകാമോ?",
    "options": [
      "അതെ, കാരണം ഡ്രൈവർ മാത്രമാണ് ഉത്തരവാദി",
      "അതെ, ആ വ്യക്തി ഡ്രൈവിംഗ് വിദഗ്ദ്ധനാണെങ്കിൽ",
      "വാഹനം അപകടത്തിൽപ്പെട്ടാൽ മാത്രം കുറ്റകരമാണ്",
      "ഇല്ല, കാരണം വാഹനത്തിന്റെ ചുമതലയുള്ള വ്യക്തിയും ബാധ്യസ്ഥനാണ്, അത് ഗുരുതരമായ കുറ്റമാണ്"
    ],
    "sign": "/signs/sign_255.png",
    "answerIndex": 3
  },
  {
    "id": 256,
    "q": "സ്റ്റാൻഡേർഡ് ഹെഡ്‌ലൈറ്റുകൾക്ക് പുറമെ അധിക ഹെഡ്‌ലൈറ്റുകൾ നൽകാമോ?",
    "options": [
      "അതെ, കൂടുതൽ ലൈറ്റ് ചേർക്കുന്നത് റോഡ് കൂടുതൽ പ്രകാശമുള്ളതാക്കുന്നു",
      "അതെ, വാഹനത്തിന്റെ ഹെഡ്‌ലൈറ്റിന് കാഴ്ച കുറയുമ്പോഴെല്ലാം ഒന്ന് ചേർക്കാം",
      "ഇല്ല, അധിക ലൈറ്റുകൾ അനുവദനീയമല്ല",
      "വാഹനത്തിന്റെ അടിഭാഗത്ത് നൽകാം"
    ],
    "sign": "/signs/sign_256.png",
    "answerIndex": 3
  },
  {
    "id": 257,
    "q": "റിയർവ്യൂ മിററിൽ ഒന്നും ഘടിപ്പിക്കുകയോ തൂക്കിയിടുകയോ ചെയ്യരുത്...",
    "options": [
      "നിയമത്തിന് വിരുദ്ധമാണ്",
      "അതിന്റെ വലുപ്പം അനുസരിച്ച് അനുവദനീയമാണ്",
      "ഡ്രൈവറുടെ കാഴ്ച്ചയെ തടസ്സപ്പെടുത്തുന്നില്ലെങ്കിൽ അനുവദനീയമാണ്",
      "മറ്റ് റോഡ് ഉപയോക്താക്കൾക്ക് തടസ്സമുണ്ടാക്കുന്നില്ലെങ്കിൽ അനുവദനീയമാണ്"
    ],
    "sign": "/signs/sign_257.png",
    "answerIndex": 0
  },
  {
    "id": 258,
    "q": "ഒരുമിച്ച് ഓടിക്കുമ്പോൾ (ഗ്രൂപ്പ് റൈഡിംഗ്), റോഡിൽ ഓടിക്കുന്ന രണ്ടോ അതിലധികമോ മോട്ടോർസൈക്കിളുകളുടെ സ്ഥാനങ്ങൾ?",
    "options": [
      "അരികൊട് അരിക്",
      "മോട്ടോർസൈക്കിളുകൾക്കിടയിൽ ശരിയായ അകലം പാലിച്ച് ഒരു ഒന്നിടവിട്ട നിര (staggered line) നിലനിർത്തുക",
      "ഒന്നിന് പുറകെ ഒന്നായി ഒറ്റ വരിയിൽ യാത്ര ചെയ്യുക",
      "മുകളിൽ പറഞ്ഞവയെല്ലാം"
    ],
    "sign": "/signs/sign_258.png",
    "answerIndex": 1
  },
  {
    "id": 259,
    "q": "ഡ്രൈവർമാർ ഹോൺ മുഴക്കരുത്...",
    "options": [
      "വൺവേ റോഡിൽ",
      "പ്രധാന റോഡിൽ",
      "നിശബ്ദ മേഖലയിൽ (silent zone)",
      "മുകളിൽ പറഞ്ഞവയെല്ലാം"
    ],
    "sign": "/signs/sign_259.png",
    "answerIndex": 2
  },
  {
    "id": 260,
    "q": "രജിസ്ട്രേഷൻ നമ്പറുകൾ ഏത് നിറത്തിലുള്ള വെളിച്ചത്തിലാണ് പ്രകാശിപ്പിക്കേണ്ടത്?",
    "options": [
      "ചുവന്ന വെളിച്ചം",
      "വെള്ള വെളിച്ചം",
      "നീല വെളിച്ചം",
      "ആംബർ വെളിച്ചം"
    ],
    "sign": "/signs/sign_260.png",
    "answerIndex": 1
  },
  {
    "id": 261,
    "q": "എംവി ആക്റ്റ്, 1988-ലെ സെക്ഷൻ 131 ഡ്രൈവറുടെ ചുമതലകൾ വ്യക്തമാക്കുന്നു",
    "options": [
      "ലൈസൻസും രജിസ്ട്രേഷൻ സർട്ടിഫിക്കറ്റും ഹാജരാക്കാനുള്ള കടമ സംബന്ധിച്ച്",
      "സിഗ്നലുകളെയും സിഗ്നലിംഗ് ഉപകരണങ്ങളെയും സംബന്ധിച്ച്",
      "ആളില്ലാത്ത റെയിൽവേ ലെവൽ ക്രോസിംഗുകളിലെ മുൻകരുതലുകളെ സംബന്ധിച്ച്",
      "ഒരു അപകടമുണ്ടായാൽ ഡ്രൈവറുടെ കടമ സംബന്ധിച്ച്"
    ],
    "sign": "/signs/sign_261.png",
    "answerIndex": 2
  },
  {
    "id": 267,
    "q": "ഏതെങ്കിലും ക്ലാസ് വാഹനങ്ങളിൽ ഓഡിയോ-വിഷ്വൽ ഉപകരണങ്ങൾ അനുവദനീയമാണോ? ആണെങ്കിൽ, ഏത് ക്ലാസിൽ?",
    "options": [
      "അതെ, സ്റ്റേജ് ക്യാരേജ് ബസുകളിൽ",
      "അതെ, എ ആർ (AR) ഒഴികെയുള്ള കോൺട്രാക്റ്റ് ക്യാരേജുകളിൽ",
      "അതെ, ഇഐബി-യിൽ (EIB)",
      "ഒരു ക്ലാസ് വാഹനത്തിനും അനുവദനീയമല്ല"
    ],
    "sign": "/signs/sign_267.png",
    "answerIndex": 1
  },
  {
    "id": 268,
    "q": "രക്തത്തിലെ മദ്യത്തിന്റെ അളവ് ……….. കവിഞ്ഞാൽ മദ്യപിച്ച് വാഹനമോടിക്കുന്നത് ശിക്ഷാർഹമാണ്.",
    "options": [
      "100 മില്ലി രക്തത്തിൽ 30 മില്ലിഗ്രാമിൽ കുറവ്",
      "100 മില്ലി രക്തത്തിൽ 100 മില്ലിഗ്രാമിൽ കൂടുതൽ",
      "മുകളിൽ പറഞ്ഞവ ഒന്നുമല്ല"
    ],
    "sign": "/signs/sign_268.png",
    "answerIndex": -1
  },
  {
    "id": 269,
    "q": "ഡ്രൈവർക്ക് അരികിൽ ഇരിക്കുന്നവരോ നിൽക്കുന്നവരോ വാഹനം നിയന്ത്രിക്കുന്നതിൽ അസൗകര്യം ഉണ്ടാക്കിയാൽ",
    "options": [
      "ആർടിഒയുടെ അനുമതിയോടെ ഇത് അനുവദിക്കാം",
      "അനുവദനീയമല്ല",
      "അടിയന്തിര സാഹചര്യങ്ങളിൽ അനുവദനീയമാണ്",
      "ഇതൊരു കുറ്റമല്ല 1086"
    ],
    "sign": "/signs/sign_269.png",
    "answerIndex": 1
  },
  {
    "id": 270,
    "q": "വാണിജ്യ വാഹനങ്ങളുടെ (commercial vehicles) നമ്പർ പ്ലേറ്റിന്റെ നിറം?",
    "options": [
      "മഞ്ഞ പശ്ചാത്തലത്തിൽ കറുത്ത അക്ഷരങ്ങളും അക്കങ്ങളും",
      "കറുത്ത പശ്ചാത്തലത്തിൽ മഞ്ഞ അക്ഷരങ്ങൾ",
      "വെളുത്ത പശ്ചാത്തലത്തിൽ കറുത്ത അക്ഷരങ്ങൾ",
      "മഞ്ഞ പശ്ചാത്തലത്തിൽ വെളുത്ത അക്ഷരങ്ങളും അക്കങ്ങളും"
    ],
    "sign": "/signs/sign_270.png",
    "answerIndex": 0
  },
  {
    "id": 271,
    "q": "നിങ്ങൾക്ക് ഡ്രൈവിംഗ് ടെസ്റ്റിന് ഹാജരാകാം",
    "options": [
      "ലേണേഴ്‌സ് ലൈസൻസ് എടുത്തതിന്റെ പിറ്റേന്ന് മുതൽ",
      "ലേണേഴ്‌സ് ലൈസൻസ് എടുത്ത് 30 ദിവസം കഴിഞ്ഞ്",
      "ലേണേഴ്‌സ് ലൈസൻസ് എടുത്ത് 60 ദിവസം കഴിഞ്ഞ്",
      "ലേണേഴ്‌സ് ലൈസൻസ് എടുത്ത് 90 ദിവസം കഴിഞ്ഞ്"
    ],
    "sign": "/signs/sign_271.png",
    "answerIndex": 1
  },
  {
    "id": 272,
    "q": "ഒരു സ്വകാര്യ വാഹനത്തിന്റെ (private vehicle) നമ്പർ പ്ലേറ്റിന്റെ നിറം?",
    "options": [
      "കറുത്ത പശ്ചാത്തലത്തിൽ മഞ്ഞ അക്ഷരങ്ങളും അക്കങ്ങളും",
      "മഞ്ഞ പശ്ചാത്തലത്തിൽ കറുത്ത അക്ഷരങ്ങൾ",
      "കറുത്ത പശ്ചാത്തലത്തിൽ വെളുത്ത അക്ഷരങ്ങളും അക്കങ്ങളും",
      "വെളുത്ത പശ്ചാത്തലത്തിൽ കറുത്ത അക്ഷരങ്ങൾ"
    ],
    "sign": "/signs/sign_272.png",
    "answerIndex": 3
  },
  {
    "id": 273,
    "q": "നിങ്ങൾ ഒരു ഇടുങ്ങിയ പാലത്തെ സമീപിക്കുമ്പോൾ, എതിർദിശയിൽ നിന്ന് മറ്റൊരു വാഹനം പാലത്തിലേക്ക് പ്രവേശിക്കാൻ തുടങ്ങുകയാണെങ്കിൽ, നിങ്ങൾ എന്തുചെയ്യണം?",
    "options": [
      "വേഗത കൂട്ടി പാലം കടക്കാൻ പരമാവധി ശ്രമിക്കുക",
      "ഹെഡ്‌ലൈറ്റ് ഓൺ ചെയ്ത് പാലം കടക്കുക",
      "മറ്റ് വാഹനം പാലം കടക്കുന്നതുവരെ കാത്തിരിക്കുക, തുടർന്ന് മുന്നോട്ട് പോകുക",
      "മുകളിൽ പറഞ്ഞവ ഒന്നുമല്ല"
    ],
    "sign": "/signs/sign_273.png",
    "answerIndex": 2
  },
  {
    "id": 274,
    "q": "ഹോൺ ഉപയോഗിക്കുന്നത് നിരോധിച്ചിരിക്കുന്നു",
    "options": [
      "പള്ളി, അമ്പലം എന്നിവയുടെ അടുത്ത്",
      "ആശുപത്രികൾ, കോടതികൾ എന്നിവയുടെ അടുത്ത്",
      "പോലീസ് സ്റ്റേഷന് അടുത്ത്",
      "ജംഗ്ഷനുകളിൽ"
    ],
    "sign": "/signs/sign_274.png",
    "answerIndex": 1
  },
  {
    "id": 275,
    "q": "ഒരു സ്വകാര്യ വാഹനത്തിന്റെ രേഖകൾ",
    "options": [
      "രജിസ്ട്രേഷൻ സർട്ടിഫിക്കറ്റ്, ജി.സി.ആർ, ഇൻഷുറൻസ് സർട്ടിഫിക്കറ്റ് \nരജിസ്ട്രേഷൻ സർട്ടിഫിക്കറ്റ്, ഇൻഷുറൻസ് സർട്ടിഫിക്കറ്റ്, ടാക്സ് ടോക്കൺ, പിയുസി സർട്ടിഫിക്കറ്റ്",
      "രജിസ്ട്രേഷൻ സർട്ടിഫിക്കറ്റ്, പെർമിറ്റ്, പിയുസി സർട്ടിഫിക്കറ്റ്, ഇൻഷുറൻസ് സർട്ടിഫിക്കറ്റ്",
      "രജിസ്ട്രേഷൻ സർട്ടിഫിക്കറ്റ്, ജി.സി.ആർ, പെർമിറ്റ്, പിയുസി സർട്ടിഫിക്കറ്റ്, ഇൻഷുറൻസ് സർട്ടിഫിക്കറ്റ്"
    ],
    "sign": "/signs/sign_275.png",
    "answerIndex": 0
  },
  {
    "id": 276,
    "q": "സ്കൂൾ ബസുകൾ വിദ്യാർത്ഥികളെ കയറ്റാനോ ഇറക്കാനോ നിർത്തുമ്പോൾ",
    "options": [
      "ഹോൺ മുഴക്കി മുന്നോട്ട് പോകുക",
      "ഹോൺ മുഴക്കി ഇടതുവശത്തുകൂടി മുന്നോട്ട് പോകുക",
      "പ്രത്യേക ശ്രദ്ധ ആവശ്യമില്ല",
      "വിദ്യാർത്ഥികൾ പെട്ടെന്ന് റോഡ് മുറിച്ചുകടക്കാൻ സാധ്യതയുള്ളതിനാൽ സാവധാനത്തിലും ജാഗ്രതയോടെയും മുന്നോട്ട് പോകുക"
    ],
    "sign": "/signs/sign_276.png",
    "answerIndex": 3
  },
  {
    "id": 277,
    "q": "ഒരു ചെറിയ റോഡിൽ നിന്ന് ഒരു വാഹനം പ്രധാന റോഡിലേക്ക് പ്രവേശിക്കുമ്പോൾ, ആർക്കാണ് മുൻഗണന നൽകേണ്ടത്?",
    "options": [
      "ഇടതുവശത്ത് നിന്ന് വരുന്ന വാഹനങ്ങൾക്ക്",
      "വലതുവശത്ത് നിന്ന് വരുന്ന വാഹനങ്ങൾക്ക്",
      "പ്രധാന റോഡിലൂടെ നീങ്ങുന്ന എല്ലാ വാഹനങ്ങൾക്കും",
      "മുൻഗണന ആവശ്യമില്ല"
    ],
    "sign": "/signs/sign_277.png",
    "answerIndex": 2
  },
  {
    "id": 278,
    "q": "മോട്ടോർ വാഹനങ്ങളിൽ ഏത് തരം ഹോണാണ് അനുവദനീയമായിട്ടുള്ളത്?",
    "options": [
      "എയർ ഹോൺ",
      "മൾട്ടി-ടോൺ ഹോൺ",
      "ഇലക്ട്രിക് ഹോൺ",
      "മുകളിൽ പറഞ്ഞവയെല്ലാം"
    ],
    "sign": "/signs/sign_278.png",
    "answerIndex": 2
  },
  {
    "id": 279,
    "q": "യാത്രക്കാരെ കയറ്റാനോ ഇറക്കാനോ നിർത്തിയ ഒരു ബസിന് പിന്നിലാണ് നിങ്ങൾ..",
    "options": [
      "ക്ഷമയോടെ പിന്നിൽ കാത്തുനിൽക്കുക",
      "ഇടതുവശത്ത് നിന്ന് ഓവർടേക്ക് ചെയ്യുക",
      "കാൽനടയാത്രക്കാരിൽ നിന്ന് അകന്ന് ഓവർടേക്ക് ചെയ്യുക",
      "മുകളിൽ പറഞ്ഞവ ഒന്നുമല്ല"
    ],
    "sign": "/signs/sign_279.png",
    "answerIndex": 0
  },
  {
    "id": 280,
    "q": "ഡ്രൈവ് ചെയ്യുമ്പോൾ നിങ്ങൾക്ക് ഇന്ധനം ലാഭിക്കാം",
    "options": [
      "ഉയർന്ന ടോർക്ക് ഗിയറിൽ ഉയർന്ന വേഗതയിൽ",
      "കുറഞ്ഞ ടോർക്ക് ഗിയറിൽ ഉയർന്ന വേഗതയിൽ",
      "ഉയർന്ന ടോർക്ക് ഗിയറുകളിൽ കുറഞ്ഞ വേഗതയിൽ",
      "ടോപ്പ് ഗിയറിൽ 45-55 കി.മീ/മണിക്കൂർ മിതമായ ഒരേ വേഗതയിൽ"
    ],
    "sign": "/signs/sign_280.png",
    "answerIndex": 3
  },
  {
    "id": 281,
    "q": "നിങ്ങളുടെ വാഹനത്തിൽ നിന്നുള്ള പുകയിൽ (exhaust smoke) എന്താണ് അടങ്ങിയിരിക്കുന്നത്?",
    "options": [
      "ഓക്സിജൻ, നൈട്രജൻ, ഹൈഡ്രോകാർബണുകൾ",
      "കാർബൺ ഡൈ ഓക്സൈഡ്, നൈട്രജൻ ഓക്സൈഡ്, ജലം",
      "കാർബൺ മോണോക്സൈഡ്, നൈട്രജൻ ഓക്സൈഡ്, ഹൈഡ്രോകാർബൺ",
      "കാർബൺ ഡൈ ഓക്സൈഡ്, നൈട്രജൻ ഓക്സൈഡ്, ഹൈഡ്രോകാർബണുകൾ"
    ],
    "sign": "/signs/sign_281.png",
    "answerIndex": 2
  },
  {
    "id": 282,
    "q": "ഉയർന്ന പവറിനായി ഉപയോഗിക്കേണ്ട ഗിയർ?",
    "options": [
      "ഒന്നാം ഗിയർ",
      "ടോപ്പ് ഗിയർ",
      "രണ്ടാം ഗിയർ",
      "മുകളിൽ പറഞ്ഞവ ഒന്നുമല്ല"
    ],
    "sign": "/signs/sign_282.png",
    "answerIndex": 0
  },
  {
    "id": 283,
    "q": "അപകടത്തിൽപ്പെട്ട ഒരാളെ ആര് ചികിത്സിക്കണം?",
    "options": [
      "ഒരു സർക്കാർ ആശുപത്രി ഡോക്ടർ മാത്രം",
      "ഏതെങ്കിലും രജിസ്റ്റർ ചെയ്ത മെഡിക്കൽ പ്രാക്ടീഷണർ അല്ലെങ്കിൽ ഡോക്ടർ",
      "ഒരു സർക്കാർ ആശുപത്രിയിലെ നഴ്സുമാർ",
      "ഇവരെല്ലാം"
    ],
    "sign": "/signs/sign_283.png",
    "answerIndex": 1
  },
  {
    "id": 284,
    "q": "താഴ്ചയിലേക്ക് (downward gradient) വാഹനം പാർക്ക് ചെയ്യുമ്പോൾ, ഹാൻഡ്‌ബ്രേക്ക് പ്രയോഗിക്കുന്നതിന് പുറമെ, ഗിയർ ……-ൽ ആയിരിക്കണം.",
    "options": [
      "ന്യൂട്രൽ ഗിയർ",
      "ഒന്നാം ഗിയർ",
      "റിവേഴ്സ് ഗിയർ",
      "ടോപ്പ് ഗിയർ"
    ],
    "sign": "/signs/sign_284.png",
    "answerIndex": 2
  },
  {
    "id": 285,
    "q": "സീറ്റ് ബെൽറ്റ് ഉപയോഗിക്കേണ്ടത്?",
    "options": [
      "ഡ്രൈവർ മാത്രം",
      "മുൻ സീറ്റിലെ യാത്രക്കാർ മാത്രം",
      "മുന്നോട്ട് അഭിമുഖീകരിക്കുന്ന എല്ലാ യാത്രക്കാരും",
      "എല്ലാ യാത്രക്കാരും"
    ],
    "sign": "/signs/sign_285.png",
    "answerIndex": 2
  },
  {
    "id": 288,
    "q": "ചിത്രത്തിൽ കാണിച്ചിരിക്കുന്ന സ്വിച്ച് എന്തിനാണ് ഉപയോഗിക്കുന്നത്?",
    "options": [
      "ഹെഡ്‌ലൈറ്റിന്റെ തെളിച്ചം കൂട്ടാൻ",
      "ഹെഡ്‌ലൈറ്റ് ബീമിന്റെ ഉയരം ക്രമീകരിക്കാൻ",
      "ഹെഡ്‌ലൈറ്റ് ഓൺ/ഓഫ് ചെയ്യാൻ",
      "ഡിം/ബ്രൈറ്റ് മാറ്റാൻ"
    ],
    "sign": "/signs/sign_288.png",
    "answerIndex": 1
  },
  {
    "id": 289,
    "q": "സിംഗിൾ സ്റ്റോപ്പ് ലൈനുകൾ എവിടെയാണ് ഉപയോഗിക്കുന്നത്?",
    "options": [
      "ട്രാഫിക് സിഗ്നലുകൾക്കും കാൽനട ക്രോസിംഗുകൾക്കും മുന്നിൽ",
      "ഒരു റോഡ് ജംഗ്ഷൻ സൂചിപ്പിക്കാൻ",
      "റോഡ് അടയാളങ്ങളാൽ നിയന്ത്രിക്കപ്പെടുന്ന ജംഗ്ഷനുകളിൽ",
      "റൗണ്ട് എബൗട്ടിന്റെ പ്രവേശന കവാടത്തിൽ"
    ],
    "sign": "/signs/sign_289.png",
    "answerIndex": 0
  },
  {
    "id": 297,
    "q": "ചിത്രത്തിലെ മഞ്ഞ നിറത്തിലുള്ള റോഡ് സ്റ്റഡുകൾ എന്താണ് സൂചിപ്പിക്കുന്നത്?",
    "options": [
      "മുറിച്ചുകടക്കാൻ പാടില്ലാത്ത ഒരു രേഖ",
      "റോഡിന്റെ (carriageway) വലതുവശത്തെ അറ്റം നിർണ്ണയിക്കാൻ",
      "ഒന്നും രണ്ടും ശരിയായ ഉത്തരങ്ങളാണ്",
      "മുകളിൽ പറഞ്ഞവ ഒന്നുമല്ല"
    ],
    "sign": "/signs/sign_297.png",
    "answerIndex": 2
  },
  {
    "id": 298,
    "q": "ഒരു വാഹനത്തിൽ പതിച്ചിരിക്കുന്ന, ചിത്രത്തിൽ കാണിച്ചിരിക്കുന്ന ഈ ലോഗോ എന്തിനെയാണ് സൂചിപ്പിക്കുന്നത്?",
    "options": [
      "ഡ്രൈവിംഗ് പഠിക്കുന്ന ഒരാൾ ഉപയോഗിക്കുന്ന വാഹനം",
      "ഭിന്നശേഷിക്കാർ ഉപയോഗിക്കുന്ന വാഹനം",
      "അതൊരു പ്രത്യേക വാഹനമാണ്",
      "വീൽചെയറുള്ള വാഹനം"
    ],
    "sign": "/signs/sign_298.png",
    "answerIndex": 1
  },
  {
    "id": 299,
    "q": "ഒരു വളവിനെ സമീപിക്കുമ്പോൾ ഓവർടേക്ക് ചെയ്യുന്നത്...",
    "options": [
      "അനുവദനീയമാണ്",
      "ജാഗ്രതയോടെ അനുവദനീയമാണ്",
      "അനുവദനീയമല്ല",
      "ഒന്നും രണ്ടും ശരിയാണ്"
    ],
    "sign": "/signs/sign_299.png",
    "answerIndex": 2
  },
  {
    "id": 300,
    "q": "മൂടൽമഞ്ഞുള്ള സാഹചര്യങ്ങളിൽ, ഹെഡ്‌ലൈറ്റ് ഹൈ ബീമിൽ ഇടുന്നത്....",
    "options": [
      "നല്ലതാണ്, കാരണം കുറഞ്ഞ ദൂരത്തേക്ക് റോഡ് വ്യക്തമായി കാണാൻ കഴിയും 1",
      "മറ്റുള്ളവർക്ക് നിങ്ങളെ കാണാൻ കഴിയുമെന്ന് ഉറപ്പാക്കുന്നു",
      "മോശമാണ്, കാരണം അത് പ്രകാശത്തെ പ്രതിഫലിപ്പിക്കുകയും ചിതറിക്കുകയും ചെയ്യും",
      "നല്ലതാണ്, കാരണം ദൂരെയുള്ള റോഡ് വ്യക്തമായി കാണാൻ കഴിയും"
    ],
    "sign": "/signs/sign_300.png",
    "answerIndex": 2
  },
  {
    "id": 301,
    "q": "റോഡിൽ വാഹനമോടിക്കാൻ, പഠിതാക്കൾ (learners) നിർബന്ധമായും",
    "options": [
      "വാഹനത്തിന്റെ രജിസ്ട്രേഷൻ സർട്ടിഫിക്കറ്റ് മാത്രം കൈവശം വെക്കുക",
      "പ്രൊഫഷണലിൽ നിന്ന് നിർദ്ദേശങ്ങൾ സ്വീകരിച്ചിരിക്കണം",
      "സാധുവായ ലേണേഴ്‌സ് ലൈസൻസ് ഉണ്ടായിരിക്കണം",
      "12 മാസത്തിനുള്ളിൽ ഡ്രൈവിംഗ് ടെസ്റ്റിന് അപേക്ഷിക്കണം"
    ],
    "sign": "/signs/sign_301.png",
    "answerIndex": 2
  },
  {
    "id": 302,
    "q": "ഒരു പ്രത്യേക തരം വാഹനങ്ങൾക്കായി ഒരു ലെയ്ൻ അടയാളപ്പെടുത്തിയിട്ടുണ്ടെങ്കിൽ, മറ്റ് വാഹനങ്ങൾ എന്തുചെയ്യണം?",
    "options": [
      "ലെയ്നിൽ വാഹനങ്ങൾ ഇല്ലെങ്കിൽ ആ ലെയ്ൻ ഉപയോഗിക്കാം",
      "ചിഹ്നം നിർദ്ദേശിക്കുകയാണെങ്കിൽ മാത്രം ആ ലെയ്നിൽ വാഹനമോടിക്കാം",
      "ആ ലെയ്നിൽ ഒട്ടും വാഹനമോടിക്കാൻ പാടില്ല",
      "ആ ലെയ്നിലൂടെ കുറഞ്ഞ ദൂരം ഓടിക്കുക"
    ],
    "sign": "/signs/sign_302.png",
    "answerIndex": 2
  },
  {
    "id": 303,
    "q": "ലേണേഴ്‌സ് ലൈസൻസിന്റെ കാലാവധി എത്രയാണ്?",
    "options": [
      "ഡ്രൈവിംഗ് ലൈസൻസ് ലഭിക്കുന്നതുവരെ"
    ],
    "sign": "/signs/sign_303.png",
    "answerIndex": -1
  },
  {
    "id": 304,
    "q": "PUCC എന്നതുകൊണ്ട് എന്താണ് അർത്ഥമാക്കുന്നത്?",
    "options": [
      "പൊലൂഷൻ അണ്ടർ കൺട്രോൾ/കാൻസലേഷൻ",
      "പൊലൂഷൻ അണ്ടർ കൺട്രോൾ സർട്ടിഫിക്കറ്റ്",
      "പൊലൂഷൻ അണ്ടർ കാൻസലേഷൻ സർട്ടിഫിക്കറ്റ്",
      "പൊലൂഷൻ അൺകൺട്രോൾഡ് സർട്ടിഫിക്കറ്റ്"
    ],
    "sign": "/signs/sign_304.png",
    "answerIndex": 1
  },
  {
    "id": 306,
    "q": "നിങ്ങൾ ഒരു മോട്ടോർസൈക്കിൾ അപകടസ്ഥലത്ത് എത്തുന്നു. മറ്റ് വാഹനങ്ങളൊന്നും ഉൾപ്പെട്ടിട്ടില്ല. റൈഡർ റോഡിന് നടുവിൽ അബോധാവസ്ഥയിൽ കിടക്കുന്നു. നിങ്ങൾ ആദ്യം ചെയ്യേണ്ടത് എന്താണ്?",
    "options": [
      "റൈഡറെ റോഡിൽ നിന്ന് മാറ്റുക",
      "മറ്റ് വാഹനങ്ങൾക്ക് മുന്നറിയിപ്പ് നൽകുക",
      "റോഡിൽ നിന്നുള്ള അവശിഷ്ടങ്ങൾ നീക്കം ചെയ്യുക",
      "റൈഡറെ ആശ്വസിപ്പിക്കുക"
    ],
    "sign": "/signs/sign_306.png",
    "answerIndex": 1
  },
  {
    "id": 307,
    "q": "താഴെ പറയുന്നവയിൽ ഏത് വാഹനത്തിനാണ് മുൻഗണന?",
    "options": [
      "പോലീസ് വാഹനങ്ങൾ",
      "ബസുകൾ",
      "എമർജൻസി വാഹനങ്ങൾ (ആംബുലൻസ്, ഫയർ എഞ്ചിൻ)",
      "ഇരുചക്ര വാഹനങ്ങൾ"
    ],
    "sign": "/signs/sign_307.png",
    "answerIndex": 2
  },
  {
    "id": 308,
    "q": "ഇരുചക്രവാഹനത്തിൽ ഒന്നിലധികം പേർ യാത്ര ചെയ്യുന്നത്?",
    "options": [
      "ട്രാഫിക് കുറവായിരിക്കുമ്പോൾ അനുവദനീയമാണ്",
      "നിയമലംഘനമാണ്",
      "ചില സ്ഥലങ്ങളിൽ അനുവദനീയമാണ്",
      "അനുവദനീയമാണ്"
    ],
    "sign": "/signs/sign_308.png",
    "answerIndex": 1
  },
  {
    "id": 309,
    "q": "രജിസ്റ്റർ ചെയ്യാത്ത വാഹനങ്ങൾ പൊതുസ്ഥലങ്ങളിൽ ഉപയോഗിക്കുന്നത്",
    "options": [
      "നിയമവിരുദ്ധമാണ്",
      "നിയമപരമാണ്",
      "ചില സ്ഥലങ്ങളിൽ അനുവദനീയമാണ്",
      "ട്രാഫിക് കുറവായിരിക്കുമ്പോൾ അനുവദനീയമാണ്"
    ],
    "sign": "/signs/sign_309.png",
    "answerIndex": 0
  },
  {
    "id": 310,
    "q": "\"U\" ടേൺ തിരിയുന്നത് നിരോധിച്ചിരിക്കുന്നത് എവിടെയാണ്?",
    "options": [
      "ഒരു റൗണ്ട് എബൗട്ടിൽ",
      "റോഡ് ചിഹ്നമോ ട്രാഫിക് സിഗ്നലോ വഴി നിരോധിച്ചിരിക്കുന്നിടത്ത്",
      "ഒരു പാർക്കിംഗ് ലോട്ടിൽ",
      "ജനവാസമുള്ള തെരുവിൽ"
    ],
    "sign": "/signs/sign_310.png",
    "answerIndex": 1
  },
  {
    "id": 311,
    "q": "വലത്തേക്ക് തിരിയുമ്പോൾ ഒരു ഡ്രൈവർ എന്താണ് ഉറപ്പാക്കേണ്ടത്?",
    "options": [
      "ജംഗ്ഷനിൽ ആദ്യത്തെ വാഹനം അവരാണെന്ന്",
      "മറ്റ് ഉപയോക്താക്കൾക്ക് മുൻഗണന നൽകാൻ",
      "മറ്റുള്ളവരെ അറിയിക്കാൻ ഹോൺ ഉപയോഗിക്കുക",
      "യാത്രക്കാർ ആരുമില്ലെന്ന്"
    ],
    "sign": "/signs/sign_311.png",
    "answerIndex": 1
  },
  {
    "id": 312,
    "q": "നിങ്ങൾ റോഡിലൂടെ വാഹനമോടിക്കുമ്പോൾ മഴ പെയ്താൽ എന്തുചെയ്യണം?",
    "options": [
      "വേഗത പകുതിയായി കുറയ്ക്കണം",
      "വാഹനത്തിൽ നിന്ന് കൂടുതൽ അകലം പാലിക്കണം",
      "പെട്ടെന്നുള്ള ബ്രേക്കിംഗും ആക്സിലറേഷനും ഒഴിവാക്കണം",
      "മുകളിൽ പറഞ്ഞവയെല്ലാം പാലിക്കണം"
    ],
    "sign": "/signs/sign_312.png",
    "answerIndex": 3
  },
  {
    "id": 313,
    "q": "റോഡിൽ ഒരു ഡ്രൈവിംഗ് സ്കൂൾ വാഹനം കണ്ടാൽ",
    "options": [
      "നിരന്തരം ഹോൺ മുഴക്കുക 1258",
      "ഹെഡ്‌ലൈറ്റുകൾ ഫ്ലാഷ് ചെയ്ത് മുന്നറിയിപ്പ് നൽകുക",
      "വാഹനം വേഗത കുറച്ച് ജാഗ്രതയോടെ സമീപിക്കുക",
      "വേഗത കൂട്ടി വേഗം കടന്നുപോകുക"
    ],
    "sign": "/signs/sign_313.png",
    "answerIndex": 2
  },
  {
    "id": 314,
    "q": "ഒരു മോട്ടോർ വാഹനത്തിലെ ആക്സിലറേറ്ററിന്റെ പ്രധാന ധർമ്മം എന്താണ്?",
    "options": [
      "വാഹനത്തിന്റെ വേഗത കൂട്ടാൻ",
      "വാഹനത്തിന്റെ വേഗത കുറയ്ക്കാൻ",
      "വാഹനത്തിന്റെ ദിശ മാറ്റാൻ",
      "ബ്രേക്ക് പ്രയോഗിക്കാൻ"
    ],
    "sign": "/signs/sign_314.png",
    "answerIndex": 0
  },
  {
    "id": 315,
    "q": "ഒരു വാഹനത്തിന്റെ ദിശ മാറ്റുക എന്നത് താഴെ പറയുന്നവയിൽ ഏതിന്റെ ധർമ്മമാണ്?",
    "options": [
      "ക്ലച്ച്",
      "സ്റ്റിയറിംഗ് വീൽ",
      "ആക്സിലറേറ്റർ",
      "ബ്രേക്ക് പെഡൽ"
    ],
    "sign": "/signs/sign_315.png",
    "answerIndex": 1
  },
  {
    "id": 316,
    "q": "ഒരു മാനുവൽ ട്രാൻസ്മിഷൻ വാഹനത്തിലെ ക്ലച്ച് ഉപയോഗിക്കുന്നത്......",
    "options": [
      "എഞ്ചിൻ സ്റ്റാർട്ട് ചെയ്യാൻ",
      "സുഗമമായി ഗിയറുകൾ മാറ്റാൻ",
      "വാഹനത്തിന്റെ വേഗത നിയന്ത്രിക്കാൻ",
      "ബ്രേക്ക് പ്രയോഗിക്കാൻ"
    ],
    "sign": "/signs/sign_316.png",
    "answerIndex": 1
  },
  {
    "id": 317,
    "q": "ഒരു മാനുവൽ ട്രാൻസ്മിഷൻ വാഹനത്തിലെ ഗിയർ ലിവറിന്റെ ഉദ്ദേശ്യം എന്താണ്?",
    "options": [
      "വാഹനത്തിന്റെ വേഗത കൂട്ടാൻ",
      "ബ്രേക്കുകൾ നിയന്ത്രിക്കാൻ",
      "വാഹനത്തിന്റെ ദിശ മാറ്റാൻ",
      "വാഹനത്തിന്റെ ഗിയർ മാറ്റാൻ"
    ],
    "sign": "/signs/sign_317.png",
    "answerIndex": 3
  },
  {
    "id": 318,
    "q": "ഒരു വാഹനത്തിലെ ബ്രേക്ക് പെഡൽ പ്രധാനമായും ഉപയോഗിക്കുന്നത്......",
    "options": [
      "വാഹനത്തിന്റെ വേഗത കൂട്ടാൻ",
      "വാഹനത്തിന്റെ ദിശ നിയന്ത്രിക്കാൻ",
      "നിർത്താനോ വേഗത കുറയ്ക്കാനോ",
      "പാർക്കിംഗ് ബ്രേക്ക് ഇടാൻ"
    ],
    "sign": "/signs/sign_318.png",
    "answerIndex": 2
  },
  {
    "id": 319,
    "q": "\"എഞ്ചിൻ ബ്രേക്കിംഗ്\" എന്നതുകൊണ്ട് എന്താണ് അർത്ഥമാക്കുന്നത്?",
    "options": [
      "പാർക്കിംഗ് ബ്രേക്ക് പ്രയോഗിക്കുന്നത്",
      "ഡൗൺഷിഫ്റ്റ് ചെയ്ത് എഞ്ചിൻ കംപ്രഷൻ ഉപയോഗിച്ച് വാഹനത്തിന്റെ വേഗത കുറയ്ക്കുന്നത്",
      "വാഹനത്തിന്റെ വേഗത കുറയ്ക്കാൻ ബ്രേക്ക് പെഡൽ ഉപയോഗിക്കുന്നത്",
      "വീൽ ലോക്ക്-അപ്പ് തടയാൻ എബിഎസ് (ABS) ഉപയോഗിക്കുന്നത്"
    ],
    "sign": "/signs/sign_319.png",
    "answerIndex": 1
  },
  {
    "id": 320,
    "q": "സുഗമമായ പവർ സ്റ്റിയറിംഗ് നൽകാൻ വാഹനങ്ങളെ സഹായിക്കുന്ന ഘടകം ഏതാണ്?",
    "options": [
      "ബ്രേക്ക് ഫ്ലൂയിഡ്",
      "പവർ സ്റ്റിയറിംഗ് ഫ്ലൂയിഡ്",
      "ട്രാൻസ്മിഷൻ ഫ്ലൂയിഡ്",
      "എഞ്ചിൻ ഓയിൽ"
    ],
    "sign": "/signs/sign_320.png",
    "answerIndex": 1
  },
  {
    "id": 321,
    "q": "ഒരു വാഹനത്തിലെ ക്രൂയിസ് കൺട്രോൾ പ്രധാനമായും ഉപയോഗിക്കുന്നത്.....",
    "options": [
      "ബ്രേക്കിംഗ് സിസ്റ്റം നിയന്ത്രിക്കാൻ",
      "യാന്ത്രികമായി ഗിയറുകൾ മാറ്റാൻ",
      "ആക്സിലറേറ്റർ അമർത്താതെ സ്ഥിരമായ വേഗത നിലനിർത്താൻ",
      "വാഹനം സ്റ്റിയർ ചെയ്യാൻ"
    ],
    "sign": "/signs/sign_321.png",
    "answerIndex": 2
  },
  {
    "id": 322,
    "q": "റോഡിന് സമാന്തരമായി (parallel parking) പാർക്ക് ചെയ്യുമ്പോൾ നിങ്ങൾ എന്തുചെയ്യണം?",
    "options": [
      "പാർക്കിംഗ് സ്ഥലത്തിന് മുന്നിലുള്ള വാഹനവുമായി നേർരേഖയിലാക്കുക",
      "മിററുകളും ബ്ലൈൻഡ് സ്പോട്ടുകളും പരിശോധിക്കുക",
      "പാർക്ക് ചെയ്യുന്നതിന് മുമ്പ് സിഗ്നൽ നൽകുക",
      "മുകളിൽ പറഞ്ഞവയെല്ലാം"
    ],
    "sign": "/signs/sign_322.png",
    "answerIndex": 3
  },
  {
    "id": 323,
    "q": "MSM തത്വത്തിന്റെ ശരിയായ പ്രവർത്തന ക്രമം എന്താണ്?",
    "options": [
      "സിഗ്നൽ, മന്യൂവർ (പ്രവർത്തനം), മിറർ",
      "മിറർ, സ്പീഡ് (വേഗത), മന്യൂവർ (പ്രവർത്തനം)",
      "മിറർ (കണ്ണാടി), സിഗ്നൽ (സൂചന), മന്യൂവർ (പ്രവർത്തനം)",
      "സിഗ്നൽ, മിറർ, മന്യൂവർ (പ്രവർത്തനം)"
    ],
    "sign": "/signs/sign_323.png",
    "answerIndex": 2
  },
  {
    "id": 324,
    "q": "MSM രീതിയുടെ ഭാഗമായി, നിങ്ങൾ എപ്പോഴാണ് നിങ്ങളുടെ മിറർ പരിശോധിക്കേണ്ടത്?",
    "options": [
      "ലെയ്ൻ മാറുമ്പോൾ മാത്രം",
      "സിഗ്നൽ നൽകുന്നതിനും ഏതെങ്കിലും പ്രവർത്തനം ചെയ്യുന്നതിനും മുമ്പ്",
      "സിഗ്നൽ നൽകിയ ശേഷം",
      "തിരിഞ്ഞതിന് ശേഷം"
    ],
    "sign": "/signs/sign_324.png",
    "answerIndex": 1
  },
  {
    "id": 325,
    "q": "താഴെ പറയുന്നവയിൽ ഏതാണ് PSL രീതിയെ മികച്ച രീതിയിൽ വിവരിക്കുന്നത്?",
    "options": [
      "പൊസിഷൻ (സ്ഥാനം), സ്പീഡ് (വേഗത), ലുക്ക് (നോട്ടം)",
      "പൊസിഷൻ (സ്ഥാനം), സിഗ്നൽ (സൂചന), ലുക്ക് (നോട്ടം)",
      "പൊസിഷൻ (സ്ഥാനം), സ്പീഡ് (വേഗത), മന്യൂവർ (പ്രവർത്തനം)",
      "പൊസിഷൻ (സ്ഥാനം), സ്പീഡ് (വേഗത), മിറർ (കണ്ണാടി)"
    ],
    "sign": "/signs/sign_325.png",
    "answerIndex": 0
  },
  {
    "id": 326,
    "q": "PSL രീതിയിൽ ഒരു പ്രവർത്തനം ചെയ്യുന്നതിന് മുമ്പ് പരിശോധിക്കേണ്ട പ്രധാന കാര്യം എന്താണ്?",
    "options": [
      "നിങ്ങളുടെ വാഹനത്തിന്റെ വേഗത മാത്രം",
      "റോഡിന്റെ സ്ഥാനം, വേഗത, മിററുകൾ",
      "നിങ്ങളുടെ ബ്ലൈൻഡ് സ്പോട്ടുകൾ മാത്രം",
      "നിങ്ങളുടെ പിന്നിലുള്ള കാർ 1"
    ],
    "sign": "/signs/sign_326.png",
    "answerIndex": 1
  },
  {
    "id": 327,
    "q": "നിങ്ങൾ ഇടത്തേക്ക് തിരിയാൻ ഒരു ജംഗ്ഷനെ സമീപിക്കുന്നു. MSM രീതി അനുസരിച്ച്, നിങ്ങൾ എന്തുചെയ്യണം?",
    "options": [
      "ഇടത്തേക്ക് സിഗ്നൽ നൽകുക, തുടർന്ന് മിററുകൾ പരിശോധിച്ച് തിരിയുക",
      "ഇടത്തേക്ക് സിഗ്നൽ നൽകി ഉടൻ തിരിയുക",
      "തിരിഞ്ഞതിന് ശേഷം മിററുകളും ബ്ലൈൻഡ് സ്പോട്ടുകളും പരിശോധിക്കുക",
      "മിററുകൾ പരിശോധിക്കുക, ഇടത്തേക്ക് സിഗ്നൽ നൽകുക, തുടർന്ന് തിരിയുക"
    ],
    "sign": "/signs/sign_327.png",
    "answerIndex": 3
  },
  {
    "id": 328,
    "q": "PSL തത്വം അനുസരിച്ച്, ഒരു അപകടസാധ്യതയെ സമീപിക്കുമ്പോൾ നിങ്ങളുടെ വേഗത എന്തായിരിക്കണം?",
    "options": [
      "അപകടസാധ്യത വേഗത്തിൽ മറികടക്കാൻ വേഗത കൂട്ടുക",
      "ഒരേ വേഗത നിലനിർത്തുക",
      "സാഹചര്യത്തിനനുസരിച്ച് നിങ്ങളുടെ വേഗത ക്രമീകരിക്കുക",
      "സാധ്യമായ ഏറ്റവും കുറഞ്ഞ വേഗതയിലേക്ക് ഉടൻ വേഗത കുറയ്ക്കുക"
    ],
    "sign": "/signs/sign_328.png",
    "answerIndex": 2
  },
  {
    "id": 329,
    "q": "PSL രീതി അനുസരിച്ച്, 'ലുക്ക്' (നോട്ടം) ഘട്ടം പ്രധാനമായിരിക്കുന്നത് എന്തുകൊണ്ട്?",
    "options": [
      "നിങ്ങൾ ശരിയായ വേഗതയിലാണ് പോകുന്നതെന്ന് ഉറപ്പാക്കാൻ",
      "നിങ്ങൾ പ്രവർത്തിക്കുന്നതിന് മുമ്പ് ആരും നിങ്ങളുടെ ബ്ലൈൻഡ് സ്പോട്ടിലോ അപകടകരമായ സ്ഥാനങ്ങളിലോ ഇല്ലെന്ന് ഉറപ്പാക്കാൻ",
      "റോഡിന് ആവശ്യമായ വീതിയുണ്ടോയെന്ന് പരിശോധിക്കാൻ",
      "നിങ്ങളുടെ മിററുകൾ ക്രമീകരിച്ചിട്ടുണ്ടെന്ന് ഉറപ്പാക്കാൻ"
    ],
    "sign": "/signs/sign_329.png",
    "answerIndex": 1
  },
  {
    "id": 330,
    "q": "നിങ്ങൾ എപ്പോഴാണ് MSM രീതി ഉപയോഗിക്കേണ്ടത്?",
    "options": [
      "നിങ്ങൾ തിരിയാനോ, ഓവർടേക്ക് ചെയ്യാനോ, ദിശ മാറ്റാനോ പ്ലാൻ ചെയ്യുമ്പോഴെല്ലാം",
      "ഓവർടേക്ക് ചെയ്യുമ്പോൾ മാത്രം",
      "ജനവാസമുള്ള സ്ഥലങ്ങളിൽ വാഹനമോടിക്കുമ്പോൾ",
      "റോഡിൽ (carriageway) മാത്രം"
    ],
    "sign": "/signs/sign_330.png",
    "answerIndex": 0
  },
  {
    "id": 331,
    "q": "കാറുകളിൽ യാത്ര ചെയ്യുമ്പോൾ 12 വയസ്സിന് താഴെയുള്ള കുട്ടികളെ സംരക്ഷിക്കാൻ രൂപകൽപ്പന ചെയ്തിട്ടുള്ള ഒരു പ്രധാന സുരക്ഷാ ഉപകരണം ഏതാണ്?",
    "options": [
      "ചൈൽഡ് സീറ്റ് ബെൽറ്റ്",
      "ചൈൽഡ് റെസ്ട്രെയിന്റ് സിസ്റ്റം (കുട്ടികൾക്കായുള്ള സുരക്ഷാ സംവിധാനം)",
      "'ബേബി ഓൺ ബോർഡ്' സൈനേജ്",
      "ചൈൽഡ് ഹെഡ്‌റെസ്റ്റ്"
    ],
    "sign": "/signs/sign_331.png",
    "answerIndex": 1
  },
  {
    "id": 332,
    "q": "ചരക്കുകളുടെയോ യാത്രക്കാരുടെയോ ഒരു പ്രത്യേക ആവശ്യത്തിനായി നിർമ്മിച്ചതോ രൂപാന്തരപ്പെടുത്തിയതോ ആയ ഒരു മോട്ടോർ വാഹനത്തെ ……… എന്ന് വിളിക്കുന്നു.",
    "options": [
      "ചരക്ക് വാഹനം",
      "രൂപമാറ്റം വരുത്തിയ വാഹനം",
      "പൊതു സേവന വാഹനം (പബ്ലിക് സർവീസ് വാഹനം)",
      "പ്രത്യേക ആവശ്യത്തിനുള്ള വാഹനം (സ്പെഷ്യൽ പർപ്പസ് വാഹനം)"
    ],
    "sign": "/signs/sign_332.png",
    "answerIndex": 3
  },
  {
    "id": 333,
    "q": "ലേണേഴ്‌സ് ലൈസൻസ് അനുവദിക്കുന്നതിനുള്ള അപേക്ഷ നൽകേണ്ടത്",
    "options": [
      "ഫോം 1",
      "ഫോം 2",
      "ഫോം 3",
      "ഫോം 4"
    ],
    "sign": "/signs/sign_333.png",
    "answerIndex": 1
  },
  {
    "id": 334,
    "q": "ലേണേഴ്‌സ് ലൈസൻസോ ഡ്രൈവിംഗ് ലൈസൻസോ നേടുന്നതിന് വിലാസവും പ്രായവും തെളിയിക്കുന്ന രേഖയായി താഴെ പറയുന്നവയിൽ ഏതാണ് പരിഗണിക്കാത്തത്?",
    "options": [
      "ആധാർ കാർഡ്",
      "ഇലക്ടറൽ റോൾ (വോട്ടർ പട്ടിക)",
      "ലൈഫ് ഇൻഷുറൻസ് പോളിസി",
      "ഇലക്ട്രിസിറ്റി അല്ലെങ്കിൽ ടെലിഫോൺ ബില്ലുകൾ"
    ],
    "sign": "/signs/sign_334.png",
    "answerIndex": 3
  },
  {
    "id": 335,
    "q": "ഡ്രൈവിംഗ് ലൈസൻസ് പുതുക്കുന്നതിനുള്ള അപേക്ഷ എപ്പോൾ സമർപ്പിക്കാം?",
    "options": [
      "കാലാവധി തീരുന്നതിന് ഒരു വർഷം മുമ്പ്",
      "കാലാവധി തീർന്ന് ഒരു വർഷത്തിനുള്ളിൽ",
      "മുകളിൽ പറഞ്ഞ രണ്ടും ശരിയാണ്",
      "മുകളിൽ പറഞ്ഞവ ഒന്നുമല്ല"
    ],
    "sign": "/signs/sign_335.png",
    "answerIndex": 2
  },
  {
    "id": 336,
    "q": "ഒരു മോട്ടോർ വാഹനം രജിസ്റ്റർ ചെയ്യുന്നതിനുള്ള അപേക്ഷാ ഫോം ഏതാണ്?",
    "options": [
      "ഫോം 19",
      "ഫോം 20",
      "ഫോം 21",
      "ഫോം 22"
    ],
    "sign": "/signs/sign_336.png",
    "answerIndex": 1
  },
  {
    "id": 337,
    "q": "എപ്പോൾ മുതലാണ് വാഹന നിർമ്മാതാക്കൾ മൂന്നാമത്തെ രജിസ്ട്രേഷൻ മാർക്ക് ഉൾപ്പെടെയുള്ള ഹൈ-സെക്യൂരിറ്റി രജിസ്ട്രേഷൻ പ്ലേറ്റുകൾ (HSRP) വാഹനത്തിനൊപ്പം നൽകുന്നത്?",
    "options": [
      "2018 ഏപ്രിൽ 1 മുതൽ",
      "2018 ഒക്ടോബർ 1 മുതൽ",
      "2019 ഏപ്രിൽ 1 മുതൽ",
      "2019 ഒക്ടോബർ 1 മുതൽ"
    ],
    "sign": "/signs/sign_337.png",
    "answerIndex": 2
  },
  {
    "id": 338,
    "q": "ചരക്ക് വാഹനങ്ങളുടെ മുൻവശത്ത് ഘടിപ്പിച്ചിരിക്കുന്ന ടോപ് ലൈറ്റുകളുടെ നിറം......",
    "options": [
      "വെള്ള",
      "മഞ്ഞ",
      "നീല",
      "ചുവപ്പ്"
    ],
    "sign": "/signs/sign_338.png",
    "answerIndex": 0
  }
]


csv_file_path = 'output.csv'   # The name of the CSV file to create

# Define the exact headers you want in your CSV file
headers = [
    'id',
    'q',
    'options',
    'sign',
    'answerIndex',
    'created_at',
    'updated_at'
]

try:
    # Open the CSV file for writing
    # newline='' is important to prevent extra blank rows on Windows
    with open(csv_file_path, 'w', newline='', encoding='utf-8') as f_csv:
        # Create a CSV DictWriter, using the headers we defined
        writer = csv.DictWriter(f_csv, fieldnames=headers)
        
        # Write the header row
        writer.writeheader()
        
        # Loop through each JSON object in your data list
        for item in data:
            # Prepare a dictionary for the CSV row
            csv_row = {}
            
            # --- Handle the 'options' field ---
            # Get the 'options' list from the JSON item.
            options_list = item.get('options', [])
            # Convert the Python list back into a JSON formatted string
            csv_row['options'] = json.dumps(options_list, ensure_ascii=False)            
            # --- Handle all other fields ---
            # Use .get() for all other fields to safely handle missing keys
            for header in headers:
                if header != 'options': # We already handled options
                    # Use .get(header, '') to get the value or an empty string
                    csv_row[header] = item.get(header, '')
            
            # Write the prepared row to the CSV file
            writer.writerow(csv_row)

    print(f"Successfully converted data to '{csv_file_path}'")

except Exception as e:
    print(f"An unexpected error occurred: {e}")